[
  {
    "role": "Supervisor Personalia & Umum (HR & GA)",
    "place": "MPS KKUD Tani Mulyo",
    "city": "Lamongan",
    "type": "On Site",
    "date": "Apr 2024 - Present",
    "task": [
      "HR: developing company policies, managing recruitment and selection, developing employee training, and establishing performance evaluation and career development systems",
      "OSH: ensuring the implementation of occupational health and safety standards in production areas, identifying hazards and controlling risks, providing occupational health and safety socialization/training, and supervising compliance with applicable labor and occupational safety regulations."
    ],
    "stack": ["Microsoft Office", "Canva", "Photoshop"]
  },
  {
    "role": "Front End Engineer",
    "place": "Kementerian Kesehatan Republik Indonesia",
    "city": "South Jakarta",
    "type": "Hybrid",
    "date": "Nov 2023 - Dec 2023",
    "task": [
      "Bug fixing in the RME (Rekam Medis Elektronik) portal for the needs of health workers and agencies.",
      "Revamp RME (Rekam Medis Elektronik) to the latest version using Nuxt JS."
    ],
    "stack": ["Vue", "Nuxt", "Gitlab", "Figma", "React", "Next", "TypeScript"]
  },
  {
    "role": "Front End Developer",
    "place": "Web Media Technology Indonesia (Niagahoster)",
    "city": "Yogyakarta",
    "type": "Work From Home",
    "date": "Jun 2020 - Aug 2023",
    "task": [
      "Transformed website interface, leading to heightened user engagement and an enriched user experience.",
      "Introduced a robust design system, ensuring consistent visuals across all pages and minimizing design-related errors.",
      "Conducted thorough website performance audits, resulting in accelerated page load times and improved site responsiveness.",
      "Engineered reusable Vue JS components, streamlining development processes and fostering collaboration.",
      "Integrate with the Hostinger system so that services are better and system security can be maintained."
    ],
    "stack": ["Vue", "Nuxt", "Github", "Jira", "Figma", "Laravel", "Twig", "TypeScript"]
  },
  {
    "role": "Front End Developer",
    "place": "VIVA Media Baru (VIVA.CO.ID)",
    "city": "East Jakarta",
    "type": "On Site",
    "date": "Feb 2019 - Jun 2020",
    "task": [
      "Spearheaded the development of online media portals while also overseeing the enhancement of ad promotion plugins, effectively contributing to a dynamic digital presence.",
      "Skillfully managed and monitored SEO efforts to ensure consistent online visibility and improved search rankings."
    ],
    "stack": ["Laravel", "Bootstrap", "Gitlab"]
  },
  {
    "role": "Web Developer",
    "place": "Astrindo Senayasa",
    "city": "North Jakarta",
    "type": "On Site",
    "date": "Sep 2018 - Feb 2019",
    "task": "Engineered Human Resource Management System applications and seamlessly deployed new application releases into both test and production environments, ensuring robust software functionality.",
    "stack": ["Codeigniter", "Bootstrap"]
  },
  {
    "role": "Programming Spesialist",
    "place": "Kantor Staf Presiden Republik Indonesia",
    "city": "Central Jakarta",
    "type": "On Site",
    "date": "Mar 2018 - Jun 2018",
    "task": "Evaluated intricate database requirements, refined user interfaces for optimal usability, and effectively collaborated with local government agencies to ensure seamless coordination.",
    "stack": ["Python", "CKAN", "Bootstrap"]
  },
  {
    "role": "Front End Developer",
    "place": "Bappeda Kota Yogyakarta",
    "city": "Yogyakarta",
    "type": "Hybrid",
    "date": "May 2017 - Aug 2017",
    "task": "Revamped the interface of the Bappeda Kota Yogyakarta website, incorporating a modern design while meticulously analyzing and addressing new user interface requirements.",
    "stack": ["Codeigniter", "Bootstrap"]
  },
  {
    "role": "Digital Marketing",
    "city": "Yogyakarta",
    "type": "Hybrid",
    "place": "Relasi Inti Media",
    "date": "Oct 2016 - Jun 2017",
    "task": "Creating content for social media needs such as Instagram, Facebook, and websites as well as direct promotion to resellers and exhibitions.",
    "stack": ["Facebook", "Twitter"]
  }
]
